In [31]:
# NIM/Nama  : 19622217/Lydia Gracia
# Tanggal   :
# Deskripsi : Program memeriksa ...; input: ...; output: ...

# KAMUS
'''jenis data variabel'''
'''contoh: int, str, bool'''

'contoh: int, str, bool'

In [32]:
import pandas as pd
import matplotlib.pyplot as plt

df=pd.read_csv("problem-6-2.csv")

print(df)

                             nama      tipe_barang  bulan  tahun  qty  profit
0                Aji Suryo Wibowo  alat kebersihan      4   2016   19  184331
1           Dina Karunia Ramadhan          minuman      7   2014    3   31581
2         Theresia Dewi Inggriani       elektronik      5   2015   15  145835
3                         Sabrina          makanan      9   2016   11  112875
4                   Avit Setianto  alat kebersihan      3   2015    1   18811
...                           ...              ...    ...    ...  ...     ...
7954       Ajeng Putri Lenggogeni       alat masak      3   2015   18  175579
7955       Derie Camara Eka Putra  alat kebersihan      8   2015   13  133694
7956  Anggriawan Prasetya Putra K          makanan      8   2014   16  159809
7957        Hafiz Nafila Arditama  alat kebersihan      1   2017    4   45208
7958     Ishlah Yasini Zulqarnain       elektronik     12   2015   11  108420

[7959 rows x 6 columns]

1

In [33]:
len(df)

7959

2

In [34]:
df.loc[df["nama"]=="Tuan Wang"]

           nama tipe_barang  bulan  tahun  qty  profit
1556  Tuan Wang  elektronik      4   2017    7   12312

3

In [35]:
len(df.loc[df["profit"]>150000])

2148

4

In [44]:
sort=df.sort_values(["tahun", "bulan"], ascending=[True, True])

sort.loc[
    ((sort["tahun"]==2014) & (sort["bulan"]>=10)) | 
    ((sort["tahun"]==2015) & (sort["bulan"]<=4))]

                          nama      tipe_barang  bulan  tahun  qty  profit
17    Flesensius Agam Fradiska          minuman     10   2014   10  100327
91              Rizky Rachmadi          pakaian     10   2014   15  150757
155       James Ian Christanto  alat kebersihan     10   2014    8   81844
188            Rizky Nurachman          makanan     10   2014   18  174983
332                Arif Wijaya  alat kebersihan     10   2014   11  113119
...                        ...              ...    ...    ...  ...     ...
7831  Julianto Saut Hamonangan  alat kebersihan      4   2015    6   58945
7866              Imam Maulana       elektronik      4   2015   12  123341
7900    Philip Anugrah Raskita          makanan      4   2015   12  114258
7911    Mukhlis Achmad Zaelani       alat masak      4   2015   18  177738
7916           Nita Dwi Astuti  alat kebersihan      4   2015   15  150254

[1162 rows x 6 columns]

5

In [45]:
food=df.loc[df["tipe_barang"]=="makanan"]

food.loc[food["profit"]==food["profit"].min()]

                         nama tipe_barang  bulan  tahun  qty  profit
3194  Alvin Kurniawan Hanafie     makanan      6   2015    1   10030

6

In [40]:
y17=df.loc[df["tahun"]==2017]

y17.sort_values(["profit"], ascending=[False])[:10]

,nama,tipe_barang,bulan,tahun,qty,profit
5639,Robet Fransiska M A,alat masak,12,2017,20,199955
3861,Gregorius Gesta Danu Aji,makanan,2,2017,20,199877
3037,Dhimas Syahrial Fattah Inhardy,alat kebersihan,5,2017,20,199703
57,Resti Herwita Maharani,elektronik,11,2017,20,199687
5455,Bambang Muhammad Yusup,pakaian,1,2017,20,199573
4837,Mohamad Dika Arzaldi,alat kebersihan,6,2017,20,199543
1740,Yoval Julianto,minuman,10,2017,20,199190
3800,Muhammad Ihsan,alat kebersihan,4,2017,20,199076
6310,Marlina Siagian,elektronik,5,2017,20,199069
1886,Adhytia Azhari Rasyid,alat masak,8,2017,20,199039

7

In [42]:
df["tahun"].value_counts()

2016    2039
2014    2028
2017    1963
2015    1929
Name: tahun, dtype: int64

8

In [48]:
y16m12=df.loc[(df["tahun"]==2016) & (df["bulan"]==12)]

print(y16m12)

y16m12["profit"].mean()

                             nama      tipe_barang  bulan  tahun  qty  profit
90         Ilyas Nurfadhil Basuki       elektronik     12   2016    9   87073
107              Atika Sari Pohan  alat kebersihan     12   2016   12  117838
135            Muhammad Irvandi H          makanan     12   2016   14  137446
141   Fima Rachmawati Abdurachman          makanan     12   2016   16  156836
143                     Armiyanti       elektronik     12   2016   19  181930
...                           ...              ...    ...    ...  ...     ...
7770            Dimas Pramudyanto       alat makan     12   2016   11  111396
7796         Achmad Chafid Asyary       elektronik     12   2016   15  144891
7805                         Ifan       alat masak     12   2016    1   10291
7810                Rizky Rahmany       elektronik     12   2016    5   57285
7852         Muhammad Ridho Mukti       alat makan     12   2016    4   42164

[175 rows x 6 columns]

102165.02857142857

9

In [50]:
clothes=df.loc[df["tipe_barang"]=="pakaian"]

clothes["profit"].std()

54045.06698145228

10

In [51]:
clothesy16=clothes.loc[clothes["tahun"]<2016]

clothesy16["profit"].mean()

104515.56380952381

11

In [53]:
print(df["qty"].corr(df["profit"])) # berkorelasi positif

0.9758538110359279